results/springboot/r7gd.xlarge/wrk3.log
===== Spring Boot Benchmark (wrk) =====
Instance Type: r7gd.xlarge
Spring Boot Host: springboot-server-r7gd-xlarge

--- Warm-up Phase (30s) ---
Warm-up complete

--- Main Page - 2 threads, 50 connections, 60s ---
Running 1m test @ http://springboot-server-r7gd-xlarge:8080/
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28ms    0.94ms  35.22ms   96.80%
    Req/Sec    20.55k     1.33k   24.20k    65.58%
  Latency Distribution
     50%    1.09ms
     75%    1.34ms
     90%    1.66ms
     99%    4.95ms
  2453589 requests in 1.00m, 328.03MB read
Requests/sec:  40888.28
Transfer/sec:      5.47MB

--- Main Page - 2 threads, 100 connections, 60s ---
Running 1m test @ http://springboot-server-r7gd-xlarge:8080/
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.20ms    0.94ms  40.24ms   89.59%
    Req/Sec    22.86k     1.19k   26.83k    67.83%
  Latency Distribution
     50%    2.08ms
     75%    2.39ms
     90%    2.93ms
     99%    4.77ms
  2730550 requests in 1.00m, 365.06MB read
Requests/sec:  45461.64
Transfer/sec:      6.08MB

--- High Load - 2 threads, 200 connections, 30s ---
Running 30s test @ http://springboot-server-r7gd-xlarge:8080/
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.02ms    2.27ms 138.33ms   95.04%
    Req/Sec    25.25k     1.55k   29.55k    69.50%
  Latency Distribution
     50%    3.86ms
     75%    4.45ms
     90%    5.22ms
     99%    7.66ms
  1507631 requests in 30.09s, 201.56MB read
Requests/sec:  50109.63
Transfer/sec:      6.70MB

===== Spring Boot Benchmark Complete =====